БИТУправление_медицинским_центром_демо/src/Catalogs/ГрафикиХозяйственныхПроцедур/ГрафикиХозяйственныхПроцедур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафикиХозяйственныхПроцедур</name>
  <tabularSections>
    <name>ГрафикПроцедур</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процедура</name>
      <type>
        <types>CatalogRef.ХозяйственныеПроцедуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ГрафикиХозяйственныхПроцедур/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ТЗСтрокиГрафика = ГрафикПроцедур.Выгрузить();
	ТЗСтрокиГрафика.Свернуть("Процедура, Время");
	
	Для Каждого СтрокаГрафика Из ТЗСтрокиГрафика Цикл
		
		Если ГрафикПроцедур.НайтиСтроки(Новый Структура("Процедура, Время", СтрокаГрафика.Процедура, СтрокаГрафика.Время)).Количество() > 1 Тогда 
			ОбщегоНазначения.СообщитьОбОшибке(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru ='Процедура ""%1"" и время ""%2"" указаны дважды (ошибка)'"),
			СтрокаГрафика.Процедура,
			Формат(СтрокаГрафика.Время, "ДФ=HH:mm")), Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
